import re

"""
re.compile()用于创建一个正则表达式规则
\d表示整数, \d{3}表示3个整数，因此这个正则表达式表示"3个整数-3个整数-4个整数
==================================================================================
phoneNumRegex.search()是对字符串进行匹配操作，且只会匹配第一个合适的字符串
比如字符串是 My number is 415-555-4242，and 111-111-1111，只会匹配415-555-4242
==================================================================================
group()是返回匹配的组合，这里本质是一个列表
这里的分组与re.compile()创建的时候有关
(\d*)-(\d{3}-\d{4})表示分为两组，第一组是(\d*)，第二组是(\d{3}-\d{4})
如果是group(0)或者group()，则是415-555-4242
如果是group(1)，则是415
如果是group(2)，则是555-4242
如果是group(3)，会错误
"""
phoneNumRegex = re.compile(r'(\d*)-(\d{3}-\d{4})')
mo = phoneNumRegex.search('My number is 415-555-4242. 115-555-4242')
print('Phone number found: ' + mo.group(2))

"""
Phone number found: 415-555-4242
"""
